# Pillar 1 EDA Lecture 2

Topic:

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
os.chdir(r"C:\Users\willi\OneDrive\Documents\Woolf Institute Data Analytics\Live Class Data Sets")

In [6]:
# Load Dataset

salary_data_org = pd.read_csv("basic_salary (2).csv")

In [7]:
# Row Subsetting
salary_data_org.loc[4:9]

  First_Name Last_Name Grade Location     ba       ms
4       Neha       Rao   GR1   MUMBAI  19235  15200.0
5      Sagar    Chavan   GR2   MUMBAI  13390   6700.0
6      Aaron     Jones   GR1   MUMBAI  23280  13490.0
7       John     Patil   GR2   MUMBAI  13500  10760.0
8      Sneha     Joshi   GR1    DELHI  20660      NaN
9     Gaurav     Singh   GR2    DELHI  13760  13220.0

In [8]:
# Display row numbers 1,3 and 5 only
salary_data_org.loc[[0,2,4]]

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0

In [9]:
# Column Subsetting you use iloc
salary_data_org.iloc[:,0:4]

   First_Name Last_Name Grade Location
0        Alan     Brown   GR1    DELHI
1      Agatha  Williams   GR2   MUMBAI
2      Rajesh     Kolte   GR1   MUMBAI
3       Ameet    Mishra   GR2    DELHI
4        Neha       Rao   GR1   MUMBAI
5       Sagar    Chavan   GR2   MUMBAI
6       Aaron     Jones   GR1   MUMBAI
7        John     Patil   GR2   MUMBAI
8       Sneha     Joshi   GR1    DELHI
9      Gaurav     Singh   GR2    DELHI
10      Adela    Thomas   GR2    DELHI
11       Anup      Save   GR2   MUMBAI

In [ ]:
# Display rows 1,5,8 and columns 1 and 2 Subsetting by Rows and columns
# With labels

salary_data_org.loc[[0,4,7],['First_Name','Last_Name']]

  First_Name Last_Name
0       Alan     Brown
4       Neha       Rao
7       John     Patil

In [11]:
# with index

salary_data_org.iloc[[0,4,7],[0,1]]

  First_Name Last_Name
0       Alan     Brown
4       Neha       Rao
7       John     Patil

In [12]:
# # Create a subset with all details of employees of MUMBAI with ba 
# More than 15000

salary_data_org[(salary_data_org.Location=='MUMBAI')
&(salary_data_org.ba>15000)]

  First_Name Last_Name Grade Location     ba       ms
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0
6      Aaron     Jones   GR1   MUMBAI  23280  13490.0

In [13]:
# When you are looking at values NOT EQUAL to a certain value/condition
salary_data_org[(salary_data_org.Grade!='GR1') &
(salary_data_org.Location!="MUMBAI")]

   First_Name Last_Name Grade Location     ba       ms
3       Ameet    Mishra   GR2    DELHI  14780   9300.0
9      Gaurav     Singh   GR2    DELHI  13760  13220.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0

In [ ]:
# Subsetting the data and using the loc fxn
# Select First_Name, Grade and Location of employees of GR1 with ba
# more than 15000 
salary_data_org.loc[(salary_data_org.Grade=='GR1') &
(salary_data_org.ba>15000), ['First_Name','Grade', 'Location']]

  First_Name Grade Location
0       Alan   GR1    DELHI
2     Rajesh   GR1   MUMBAI
4       Neha   GR1   MUMBAI
6      Aaron   GR1   MUMBAI
8      Sneha   GR1    DELHI

# Sorting Data

In [15]:
# Import Dataset

salary_data = pd.read_csv("basic_salary (2).csv")

In [16]:
# Sort the data by ba in Ascending order
ba_sorted_1=salary_data.sort_values(by=['ba'])
ba_sorted_1.head()

   First_Name Last_Name Grade Location     ba       ms
11       Anup      Save   GR2   MUMBAI  11960   7880.0
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0

In [17]:
# Sort salary_data by ba in Descending order
ba_sorted_2=salary_data.sort_values(by=['ba'], ascending = False)
ba_sorted_2.head()

  First_Name Last_Name Grade Location     ba       ms
6      Aaron     Jones   GR1   MUMBAI  23280  13490.0
8      Sneha     Joshi   GR1    DELHI  20660      NaN
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0
0       Alan     Brown   GR1    DELHI  17990  16070.0

In [18]:
# Sorting by Factor Variables(Categorical Variables)   
# Sort salary_data by Grade in Ascending order
gr_sorted=salary_data.sort_values(by=['Grade'])
gr_sorted.head()

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0
6      Aaron     Jones   GR1   MUMBAI  23280  13490.0
8      Sneha     Joshi   GR1    DELHI  20660      NaN

In [19]:
# Sorting Data by Multiple Variables
# Sort salary_data by Grade and ba
grba_sorted=salary_data.sort_values(by=['Grade','ba'])
grba_sorted.head(10)

   First_Name Last_Name Grade Location     ba       ms
0        Alan     Brown   GR1    DELHI  17990  16070.0
4        Neha       Rao   GR1   MUMBAI  19235  15200.0
2      Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
8       Sneha     Joshi   GR1    DELHI  20660      NaN
6       Aaron     Jones   GR1   MUMBAI  23280  13490.0
11       Anup      Save   GR2   MUMBAI  11960   7880.0
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0

In [20]:
# Multiple Variables & Multiple Ordering Levels
# # Sort salary_data by Grade in Descending order and then by ms in Ascending order 

grms_sorted=salary_data.sort_values(by=['Grade','ms'],
 ascending=[0,1])
grms_sorted.head(10)

   First_Name Last_Name Grade Location     ba       ms
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0
11       Anup      Save   GR2   MUMBAI  11960   7880.0
3       Ameet    Mishra   GR2    DELHI  14780   9300.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
9      Gaurav     Singh   GR2    DELHI  13760  13220.0
6       Aaron     Jones   GR1   MUMBAI  23280  13490.0
2      Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
4        Neha       Rao   GR1   MUMBAI  19235  15200.0

# Merging/Appending and Aggregating data

In [21]:
sal_data = pd.read_csv("sal_data.csv")
bonus_data = pd.read_csv("bonus_data.csv")

In [25]:
sal_data.head()
bonus_data.head()

  Employee_ID  Bonus
0      E-1001  12050
1      E-1003  11400
2      E-1004  10110
3      E-1006  10650
4      E-1008  11910

In [26]:
# Display all the information(including bonus) of Employees from sal_data
leftjoin=pd.merge(sal_data,bonus_data,how='left')
print(leftjoin)

# Option 2
leftjoin_2=sal_data.merge(bonus_data,how='left')    
print(leftjoin_2)

  Employee_ID First_Name Last_Name  Basic_Salary    Bonus
0      E-1001     Mahesh     Joshi         16070  12050.0
1      E-1002     Rajesh     Kolte         14960      NaN
2      E-1004      Priya      Jain         13490  10110.0
3      E-1005      Sneha     Joshi         15660      NaN
4      E-1007        Ram    Kanade         15850      NaN
5      E-1008      Nishi    Honrao         15880  11910.0
6      E-1009     Hameed     Singh         15120      NaN
  Employee_ID First_Name Last_Name  Basic_Salary    Bonus
0      E-1001     Mahesh     Joshi         16070  12050.0
1      E-1002     Rajesh     Kolte         14960      NaN
2      E-1004      Priya      Jain         13490  10110.0
3      E-1005      Sneha     Joshi         15660      NaN
4      E-1007        Ram    Kanade         15850      NaN
5      E-1008      Nishi    Honrao         15880  11910.0
6      E-1009     Hameed     Singh         15120      NaN

In [27]:
# Display all the information(including bonus) of Employees from sal_data
rightjoin=pd.merge(sal_data,bonus_data,how='right')
print(rightjoin)

# Option 2
rightjoin_2=sal_data.merge(bonus_data,how='right')    
print(leftjoin_2)

  Employee_ID First_Name Last_Name  Basic_Salary  Bonus
0      E-1001     Mahesh     Joshi       16070.0  12050
1      E-1003        NaN       NaN           NaN  11400
2      E-1004      Priya      Jain       13490.0  10110
3      E-1006        NaN       NaN           NaN  10650
4      E-1008      Nishi    Honrao       15880.0  11910
5      E-1010        NaN       NaN           NaN  11340
  Employee_ID First_Name Last_Name  Basic_Salary    Bonus
0      E-1001     Mahesh     Joshi         16070  12050.0
1      E-1002     Rajesh     Kolte         14960      NaN
2      E-1004      Priya      Jain         13490  10110.0
3      E-1005      Sneha     Joshi         15660      NaN
4      E-1007        Ram    Kanade         15850      NaN
5      E-1008      Nishi    Honrao         15880  11910.0
6      E-1009     Hameed     Singh         15120      NaN

In [29]:
# Inner join
innerjoin=pd.merge(sal_data,bonus_data, on = 'Employee_ID')
print(innerjoin)

  Employee_ID First_Name Last_Name  Basic_Salary  Bonus
0      E-1001     Mahesh     Joshi         16070  12050
1      E-1004      Priya      Jain         13490  10110
2      E-1008      Nishi    Honrao         15880  11910

In [30]:
# Appending Data
Ba_Sal_1 = pd.read_csv("basic_salary_1.csv")
Ba_Sal_2 = pd.read_csv("basic_salary_2.csv")

In [32]:
frames=[Ba_Sal_1,Ba_Sal_2]
appendsalary=pd.concat(frames, ignore_index=True)
print(appendsalary)

   First_Name Last_Name Grade Location     ba       ms
0        Alan     Brown   GR1    DELHI  17990  16070.0
1      Agatha  Williams   GR2   MUMBAI  12390   6630.0
2      Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3       Ameet    Mishra   GR2    DELHI  14780   9300.0
4        Neha       Rao   GR1   MUMBAI  19235  15200.0
5       Sagar    Chavan   GR2   MUMBAI  13390   6700.0
6       Aaron     Jones   GR1   MUMBAI  23280  13490.0
7        John     Patil   GR2   MUMBAI  13500  10760.0
8       Sneha     Joshi   GR1    DELHI  20660      NaN
9      Gaurav     Singh   GR2    DELHI  13760  13220.0
10      Adela    Thomas   GR2    DELHI  13660   6840.0
11       Anup      Save   GR2   MUMBAI  11960   7880.0

In [33]:
# Aggregation

Sal_Data = pd.read_csv("basic_salary.csv")

In [34]:
Sal_Data.head(10)

  First_Name Last_Name Grade Location     ba       ms
0       Alan     Brown   GR1    DELHI  17990  16070.0
1     Agatha  Williams   GR2   MUMBAI  12390   6630.0
2     Rajesh     Kolte   GR1   MUMBAI  19250  14960.0
3      Ameet    Mishra   GR2    DELHI  14780   9300.0
4       Neha       Rao   GR1   MUMBAI  19235  15200.0
5      Sagar    Chavan   GR2   MUMBAI  13390   6700.0
6      Aaron     Jones   GR1   MUMBAI  23280  13490.0
7       John     Patil   GR2   MUMBAI  13500  10760.0
8      Sneha     Joshi   GR1    DELHI  20660      NaN
9     Gaurav     Singh   GR2    DELHI  13760  13220.0

In [38]:
# Calculate sum of variables 'ba' and 'ms' by variables 'Location'
# In this example we are giving multiple variables and one factor

B=Sal_Data.groupby('Location').agg({'ba':'sum','ms':'sum'})
print(B)

              ba       ms
Location
DELHI      80850  45430.0
MUMBAI    113005  75620.0